In [ ]:
!pip install mysql-connector-python

In [8]:
import mysql.connector
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

## SCRIPT DE CONEXIÓN A LA BASE DE DATOS

In [5]:
try: 
    connection = mysql.connector.connect(host=host, 
                                         database=database,
                                         user=user,
                                         password=password, connection_timeout=180)

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor()
        connection.commit()

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  8.0.36-28
MySQL connection is closed

### EJEMPLO DE CONEXIÓN A UNA BASE DE DATOS DE MYSQL

In [2]:
from dotenv import load_dotenv
import mysql.connector
import os

load_dotenv()

host = os.getenv("MYSQL_HOST")
user = os.getenv("MYSQL_USER")
password = os.getenv("MYSQL_PASSWORD")
database = os.getenv("MYSQL_DATABASE")

connection = mysql.connector.connect(
    host=host,
    user=user,
    password=password,
    database=database,
    connection_timeout=180
)

In [7]:
cursor = connection.cursor()
query1 = ''' SELECT * FROM PRODUCTO; '''
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [9]:
pd.set_option('display.max_columns', None, 'display.max_rows', None, 'display.max_colwidth', None) # Con esta opcion podemos conseguir que Pandas no tenga limites a la hora de mostrar los datos

In [10]:
connection = mysql.connector.connect(host=host, database=database, user=user, password=password, connection_timeout=180000)
tablas = "SHOW TABLES;"
df2 = pd.read_sql(tablas, connection)
df2

  Tables_in_dbgsipp7ucsuwy
0                 EMPLEADO
1                   PEDIDO
2      PEDIDOS_FINALIZADOS
3                 PRODUCTO
4        RANKING_PRODUCTOS
5               REPARTIDOR
6                   consta
7           esta_compuesto
8                    users

Defino esta funcion para que se llame a la conexion en todas las celdas:

In [11]:
def query_exe(query):
    connection = mysql.connector.connect(host=host, 
                                         database=database,
                                         user=user,
                                         password=password, connection_timeout=180)
    return pd.read_sql(query, connection)

In [12]:
connection = mysql.connector.connect(host=host, 
                                         database=database,
                                         user=user,
                                         password=password, connection_timeout=180)
df1 = pd.read_sql(query1, connection)
df1

   Codigo                         Nombre  Precio
0      01                    Hamburguesa     2.6
1      02                        Patatas     2.0
2      03                         tomate     0.5
3      04                          Queso     1.0
4      05                        Lechuga     0.5
5      06                          Pollo     3.6
6      08                          Bacon     1.5
7      09                      Coca cola     3.0
8      10                         Nestea     3.0
9      11                  Menú de Pollo     5.0
10     12  Menú de Hamburguesa con queso     6.0
11     13        Menú de Pollo con queso     6.0
12     14            Menú de Hamburguesa     6.0
13     15                         Helado     1.0
14     16                          Tarta     2.0
15     17                          Fruta     1.0
16     18                           Agua     2.0
17     19                          Fanta     3.0

In [13]:
df1.to_csv('producto.csv', index=False)

In [14]:
pd.set_option('display.max_columns', None, 'display.max_rows', None, 'display.max_colwidth', None) # Con esta opcion, conseguimos que Pandas, no tenga limites a la hora de mostrar los datos

In [16]:
connection = mysql.connector.connect(host=host, 
                                         database=database,
                                         user=user,
                                         password=password, connection_timeout=180)
esquema = pd.read_sql("SELECT * FROM INFORMATION_SCHEMA.Tables", con=connection)
esquema.head(5)

,TABLE_CATALOG,TABLE_SCHEMA,TABLE_NAME,TABLE_TYPE,ENGINE,VERSION,ROW_FORMAT,TABLE_ROWS,AVG_ROW_LENGTH,DATA_LENGTH,MAX_DATA_LENGTH,INDEX_LENGTH,DATA_FREE,AUTO_INCREMENT,CREATE_TIME,UPDATE_TIME,CHECK_TIME,TABLE_COLLATION,CHECKSUM,CREATE_OPTIONS,TABLE_COMMENT
0,def,information_schema,CHARACTER_SETS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
1,def,information_schema,CHECK_CONSTRAINTS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
2,def,information_schema,COLLATIONS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
3,def,information_schema,COLLATION_CHARACTER_SET_APPLICABILITY,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,
4,def,information_schema,COLUMNS,SYSTEM VIEW,None,10,None,0,0,0,0,0,0,NaN,2024-05-08 06:54:31,None,None,None,None,,

### Ejercicio 2

##### Obtener el número de pedido, dni del repartidor y hora de reparto de aquellos pedidos que se toman nota después de las siete de la tarde

In [22]:
query2 = """ SELECT Numero, DNI_R, Hora_rep FROM PEDIDO WHERE Hora_tm >'19:00' and Hora_rep is not null; """
print(query_exe(query2))

  Numero      DNI_R        Hora_rep
0   0005  14188151T 0 days 19:45:00
1   0006  04477744T 0 days 21:45:00
2   0007  14188151T 0 days 23:35:00

1- Obtener el listado de todos los productos

In [24]:
query3 = '''SELECT * FROM PRODUCTO;'''
print(query_exe(query3))

   Codigo                         Nombre  Precio
0      01                    Hamburguesa     2.6
1      02                        Patatas     2.0
2      03                         tomate     0.5
3      04                          Queso     1.0
4      05                        Lechuga     0.5
5      06                          Pollo     3.6
6      08                          Bacon     1.5
7      09                      Coca cola     3.0
8      10                         Nestea     3.0
9      11                  Menú de Pollo     5.0
10     12  Menú de Hamburguesa con queso     6.0
11     13        Menú de Pollo con queso     6.0
12     14            Menú de Hamburguesa     6.0
13     15                         Helado     1.0
14     16                          Tarta     2.0
15     17                          Fruta     1.0
16     18                           Agua     2.0
17     19                          Fanta     3.0

2-- Obtener el número de pedido, dni del repartidor y hora de reparto de aquellos pedidos que se toman nota después de las siete de la tarde.

In [25]:
query4 = '''SELECT p.numero AS "N.Pedido", p.DNI_R , p.Hora_rep AS "Hora" FROM PEDIDO p WHERE p.Hora_tm >= '19:00:00' and dni_r is not null;'''
print(query_exe(query4))

  N.Pedido      DNI_R            Hora
0     0006  04477744T 0 days 21:45:00
1     0005  14188151T 0 days 19:45:00
2     0007  14188151T 0 days 23:35:00

3-- Obtener todos los campos de empleados que cobran entre 900 y 1000 euros

In [26]:
query5 = '''SELECT * FROM EMPLEADO WHERE salario between 900 AND 1000;'''
print(query_exe(query5))

         DNI                 Nombre          Nss   Turno  Salario
0  04444444T   Úrsula Delta Camacho  11177788899  mañana    900.0
1  11111111Q     Luis Ramírez Pardo  23445556666  mañana    900.0
2  14111155T   Sergio Lérida Campos  55577700089   tarde   1000.0
3  22222222S      María Sánchez Cid  11112223334   tarde   1000.0
4  33333333M  Martín Guerrero López  33344455566   tarde   1000.0
5  55555555J   Carmen Hernández Pío  99966633311  mañana    900.0
6  77777777M     Pedro Jiménez Ruiz  23456785432   tarde   1000.0
7  99999999X      Raúl Rodrigo Roca  55566677789   tarde   1000.0

4-- Obtener el número de pedido e importe de aquellos que han sido registrados en el mes de noviembre de 2020 y su importe es mayor a 15 Euros.

In [28]:
query6 = '''SELECT numero, importe FROM PEDIDO WHERE fecha LIKE '2020-11-%' AND Importe > 15; '''
print(query_exe(query6))

  numero  importe
0   0006     23.0
1   0009     25.0
2   0010     45.0
3   0011     45.0

5-- Obtener por cada uno de los repartidores su DNI junto a la cantidad de pedidos entregados

In [30]:
query7 = '''SELECT p.DNI_R, count(p.DNI_R) as "Pedidos entregados" FROM PEDIDO p 
INNER JOIN REPARTIDOR r ON p.DNI_R = r.DNI
group by p.DNI_R;'''

print(query_exe(query7))

       DNI_R  Pedidos entregados
0  04477744T                   2
1  11245621Q                   1
2  14188151T                   2
3  55675675J                   1
4  99009900J                   3

6-- Obtener por cada mes (con el formato de nombre y no de número ej. Noviembre),la cantidad de pedidos realizados

In [33]:
query8 = '''select date_format(p.fecha, '%M') as "month", count(p.numero) as "N. Pedidos" from PEDIDO p group by date_format(p.fecha, '%M');'''
print(query_exe(query8))

       month  N. Pedidos
0    October           2
1   November           6
2  September           3

7-- Obtener un listado con el nombre y dni de los empleados en el mismo campo y anteponiendo el dni al nombre de la siguiente forma (ej; 45776633P, Juan Rodríguez López) que tenga turno de “tarde” o "noche". Ordenar el listado por dni.

In [35]:
query9 = '''select concat(dni,', ',nombre) AS 'P.Data', Turno FROM EMPLEADO where turno = 'tarde' or 'noche' order by dni;'''
print(query_exe(query9))

                             P.Data  Turno
0   14111155T, Sergio Lérida Campos  tarde
1      22222222S, María Sánchez Cid  tarde
2  33333333M, Martín Guerrero López  tarde
3     77777777M, Pedro Jiménez Ruiz  tarde
4      99999999X, Raúl Rodrigo Roca  tarde

8-- Obtener el nombre, código y precio de aquellos productos que superen o igualen la media de todos los precios. Ordenar de mayor a menor precio.

In [38]:
query10 = '''select nombre, codigo, precio from PRODUCTO where precio >= (select avg(precio) from PRODUCTO) order by precio asc;'''
print(query_exe(query10))

                          nombre codigo  precio
0                      Coca cola     09     3.0
1                         Nestea     10     3.0
2                          Fanta     19     3.0
3                          Pollo     06     3.6
4                  Menú de Pollo     11     5.0
5  Menú de Hamburguesa con queso     12     6.0
6        Menú de Pollo con queso     13     6.0
7            Menú de Hamburguesa     14     6.0

9-- Obtener un listado con el nombre y DNI de los empleados que no han preparado nunca ningún pedido.

In [40]:
query11 = '''select e.nombre, e.DNI from EMPLEADO e where e.DNI not in (select dni_ETM from PEDIDO);'''
print(query_exe(query11))

                  nombre        DNI
0   Sergio Lérida Campos  14111155T
1  Martín Guerrero López  33333333M
2   Carmen Hernández Pío  55555555J

10-- Obtener el código, nombre y precio de los productos(estos dos últimos en el mismo campo) que están contenidos en los pedidos que ha tomado nota "Luis" o "María Luisa". Ordena el listado de mayor a menor valor por fecha del pedido.

In [42]:
query12 = '''select prod.codigo, concat(prod.nombre, prod.precio) as 'Producto' FROM PRODUCTO prod, PEDIDO p WHERE p.dni_etm = (select e.dni from EMPLEADO e where e.nombre = 'Luis' or 'Maria Luisa') order by p.fecha desc;'''
print(query_exe(query12))

Empty DataFrame
Columns: [codigo, Producto]
Index: []

11-- Obtener por cada repartidor, su nombre, cantidad de pedidos y el tiempo medio que tardan en entregar los pedidos una vez preparados. Ordenar el listado el tiempo medio que tardan en entregarlos:

In [43]:
query13 = '''select r.nombre, count(p.numero) as 'Cantidad', avg(hora_rep) as 'Media H.' from REPARTIDOR r, PEDIDO p group by r.nombre order by avg(hora_rep);'''
print(query_exe(query13))

                  nombre  Cantidad     Media H.
0  Alejandro Pardo López        11  167388.8889
1     Juan Sánchez López        11  167388.8889
2       Carmen Capel Pío        11  167388.8889
3    Carlos Sánchez Ruíz        11  167388.8889
4       Juan Pardo Rubio        11  167388.8889
5  Laura Jiménez Jiménez        11  167388.8889

12-- Obtener un listado obteniendo el código, nombre y el precio de los productos cuyo precios sea el más barato o el más caro de todos.

In [43]:
query14 = '''select codigo, precio, nombre from PRODUCTO where precio = (select min(precio) from PRODUCTO) or precio = (select max(precio) from PRODUCTO) order by nombre;'''
print(query_exe(query14))

  codigo  precio                         nombre
0     05     0.5                        Lechuga
1     14     6.0            Menú de Hamburguesa
2     12     6.0  Menú de Hamburguesa con queso
3     13     6.0        Menú de Pollo con queso
4     03     0.5                         tomate

13-- Obtener por cada producto , el nombre y código el número total de pedidos en los que se encuentra teniendo en cuenta que el total de pedidos en los cuales se encuentre sea superior o igual a dos. Ordena el listado de mayor a menor número de productos.

In [45]:
query15 = '''select codigo, precio, nombre from PRODUCTO where precio = (select min(precio) from PRODUCTO) or precio = (select max(precio) from PRODUCTO) order by nombre;'''
print(query_exe(query15))

  codigo  precio                         nombre
0     05     0.5                        Lechuga
1     14     6.0            Menú de Hamburguesa
2     12     6.0  Menú de Hamburguesa con queso
3     13     6.0        Menú de Pollo con queso
4     03     0.5                         tomate